In [ ]:
import pandas as pd
import numpy as np
df = pd.read_csv('auto_mpg.csv')
df

In [ ]:
df.head() # It will provide first five rows of data by default if the 
# number of rows to be viewed is not passed
df.tail()# It will provide last five rows of data by default if the 
# number of rows to be viewed is not passed

In [ ]:
# The describe function can be used to generate a quick summary of data statistics.
df.describe()

In [ ]:
'''To know about the datatypes and number of rows containing null values for 
respective columns, the info() function can be used'''
df.info()

In [ ]:
#  Dropping null values
# It can be observed that the ‘horsepower’ attribute has some null values. 
# The easiest approach is to remove the rows with any null values. This 
# can be achieved using dropna() function.

df.dropna(inplace = True)
df.info()

In [ ]:
#  Selecting a subset of the data
''' In addition to data access techniques, pandas also provides techniques 
for indexing and selection. Selecting a specific column in a DataFrame 
can be achieved in following ways: '''

# - Passing the column name:
df['name of column']

# - Passing the column name as a list:
df[['name of column']]

# To extract the subset of the data, we can pass the column names in a list:
df[['column1', 'column2', 'column3', 'column4']]

In [ ]:
# setting custom index 
#creating a subset using head
df_head = df.head()
#Setting name as custom index
df_head.set_index('name of column', inplace = True)
df_head

In [ ]:
#   iloc- Access a group of rows and columns by integer index
# Syntax - df.iloc[Rows, Columns]
df.iloc[2,1]

In [ ]:
#   loc- Access a group of rows and columns by custom index
# creating a subset using head. 'df' refers to XYZ Custom Cars DataFrame.
df_head = df.head()
#Setting name as custom index
df_head.set_index('name of column', inplace = True)
df_head.loc['starting': 'ending']

In [3]:
# The teacher wants to insert a ‘Total marks’ 
# column which gives the sum of marks of all subjects
marks = {'Chemistry': [67,90,66,32], 
        'Physics': [45,92,72,40],  
        'Mathematics': [50,87,81,12],  
        'English': [19,90,72,68]}
marks_df = pd.DataFrame(marks, index = ['Subodh', 'Ram', 'Abdul', 'John'])
marks_df

        Chemistry  Physics  Mathematics  English
Subodh         67       45           50       19
Ram            90       92           87       90
Abdul          66       72           81       72
John           32       40           12       68

In [9]:
marks_df['Total'] = marks_df['Chemistry'] + marks_df['Physics'] + marks_df['Mathematics'] + marks_df['English']
marks_df

        Chemistry  Physics  Mathematics  English  Total
Subodh         67       45           50       19    181
Ram            90       92           87       90    359
Abdul          66       72           81       72    291
John           32       40           12       68    152

In [10]:
# to drop a feature
marks_df.drop(columns = 'Total', inplace = True)
marks_df

        Chemistry  Physics  Mathematics  English
Subodh         67       45           50       19
Ram            90       92           87       90
Abdul          66       72           81       72
John           32       40           12       68